; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared0 - mode
	thermograph2 - mode
	thermograph1 - mode
	image3 - mode
	infrared4 - mode
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet20)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image3)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument3 thermograph2)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph1)
	(supports instrument4 image3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared4)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument6 infrared4)
	(supports instrument6 image3)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon15)
	(supports instrument7 image3)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star1)
	(supports instrument8 image3)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star17)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite3 Planet21)
	(have_image Star5 infrared0)
	(have_image Planet6 thermograph1)
	(have_image Planet8 infrared4)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 thermograph1)
	(have_image Star11 thermograph2)
	(have_image Star12 image3)
	(have_image Star13 thermograph1)
	(have_image Phenomenon14 thermograph2)
	(have_image Phenomenon15 image3)
	(have_image Phenomenon16 infrared0)
	(have_image Star17 thermograph2)
	(have_image Star18 image3)
	(have_image Planet19 image3)
	(have_image Planet20 thermograph1)
	(have_image Planet21 infrared4)
	(have_image Planet22 thermograph1)
	(have_image Phenomenon23 thermograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 20
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 20
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 20
4. (turn_to satellite4 star1 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star1)
   goals met: 0 of 20
5. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 20
6. (turn_to satellite4 phenomenon14 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 20
7. (take_image satellite4 phenomenon14 instrument7 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 1 of 20
8. (turn_to satellite4 phenomenon15 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 20
9. (take_image satellite4 phenomenon15 instrument7 image3)
   added: (have_image phenomenon15 image3)
   goals met: 2 of 20
10. (turn_to satellite4 phenomenon23 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon23)
   goals met: 2 of 20
11. (take_image satellite4 phenomenon23 instrument7 thermograph1)
   added: (have_image phenomenon23 thermograph1)
   goals met: 3 of 20
12. (turn_to satellite4 phenomenon9 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 20
13. (take_image satellite4 phenomenon9 instrument7 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 4 of 20
14. (turn_to satellite4 planet19 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet19)
   goals met: 4 of 20
15. (take_image satellite4 planet19 instrument7 image3)
   added: (have_image planet19 image3)
   goals met: 5 of 20
16. (turn_to satellite4 planet20 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet20)
   goals met: 5 of 20
17. (take_image satellite4 planet20 instrument7 thermograph1)
   added: (have_image planet20 thermograph1)
   goals met: 6 of 20
18. (turn_to satellite4 planet22 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet22)
   goals met: 6 of 20
19. (take_image satellite4 planet22 instrument7 thermograph1)
   added: (have_image planet22 thermograph1)
   goals met: 7 of 20
20. (turn_to satellite4 planet6 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet6)
   goals met: 7 of 20
21. (take_image satellite4 planet6 instrument7 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 8 of 20
22. (turn_to satellite4 star10 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star10)
   goals met: 8 of 20
23. (take_image satellite4 star10 instrument7 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 9 of 20
24. (turn_to satellite4 star11 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star11)
   goals met: 9 of 20
25. (take_image satellite4 star11 instrument7 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 10 of 20
26. (turn_to satellite4 star12 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star12)
   goals met: 10 of 20
27. (take_image satellite4 star12 instrument7 image3)
   added: (have_image star12 image3)
   goals met: 11 of 20
28. (turn_to satellite4 star13 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star13)
   goals met: 11 of 20
29. (take_image satellite4 star13 instrument7 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 12 of 20
30. (turn_to satellite4 star17 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star17)
   goals met: 12 of 20
31. (take_image satellite4 star17 instrument7 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 13 of 20
32. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 13 of 20
33. (take_image satellite4 star18 instrument7 image3)
   added: (have_image star18 image3)
   goals met: 14 of 20
34. (turn_to satellite3 planet21 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 planet21)
   goals met: 15 of 20
35. (turn_to satellite2 groundstation0 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation0)
   goals met: 15 of 20
36. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 15 of 20
37. (turn_to satellite2 planet21 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet21)
   goals met: 15 of 20
38. (take_image satellite2 planet21 instrument5 infrared4)
   added: (have_image planet21 infrared4)
   goals met: 16 of 20
39. (turn_to satellite2 planet8 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet8)
   goals met: 16 of 20
40. (take_image satellite2 planet8 instrument5 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 17 of 20
41. (turn_to satellite0 phenomenon16 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 phenomenon16)
   goals met: 17 of 20
42. (turn_to satellite0 star3 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star3)
   goals met: 17 of 20
43. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 17 of 20
44. (turn_to satellite0 phenomenon16 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon16)
   goals met: 17 of 20
45. (take_image satellite0 phenomenon16 instrument0 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 18 of 20
46. (turn_to satellite0 star10 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star10)
   goals met: 19 of 20
47. (turn_to satellite0 star5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star5)
   goals met: 18 of 20
48. (take_image satellite0 star5 instrument0 infrared0)
   added: (have_image star5 infrared0)
   goals met: 19 of 20
49. (turn_to satellite0 star10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star10)
   goals met: 20 of 20
